OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/incompressible/porousSimpleFoam/straightDuctImplicit/system/meshDict.geometry
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      meshDict.geometry;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

straightDuct.stl
{
    type triSurfaceMesh;
    name angledDuct;

    regions
    {
        wall
        {
            name walls;
        }
        porosityWall
        {
            name porosityWall;
        }
        front
        {
            name front;
        }
        inlet
        {
            name inlet;
        }
        outlet
        {
            name outlet;
        }
        back
        {
            name back;
        }
    }
}

porosity_inflated.stl
{
    type triSurfaceMesh;
    name porosity;
}

// ************************************************************************* //
